---
kind: method
id: M:Autodesk.Revit.DB.ElementId.op_Inequality(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
source: html/8fd25409-ea3f-3bb0-a1cc-6bc7c5895f31.htm
---
# Autodesk.Revit.DB.ElementId.op_Inequality Method

Determines whether these two ElementIds are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	ElementId first,
	ElementId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ElementId`) - The first ElementId.
- **second** (`Autodesk.Revit.DB.ElementId`) - The second ElementId.

## Returns
True if the ElementIds are different; otherwise, false.